Tekla Open API Reference for Tekla Structures 2025
Constants.XS_DEFAULT Field
 The value of an uninitialized Tekla Structures variable.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public const int XS_DEFAULT = -2147483648
Public Const XS_DEFAULT As Integer = -2147483648
Field Value
Type: Int32
See Also
Reference
Constants Class
Tekla.Structures.Datatype Namespace